/*
45분 일찍 알람 설정하기.

알람을 45분 일찍 설정하려고 한다. 예를 들어 현재 시간이 23시 58분이라면
알람을 설정한 시간은 23시 13분이 된다. 24시간 표시를 사용한다.(0 <= H <= 23, 0 <= M <= 59)

입력
첫째 줄에 두 정수 H와 M이 주어진다. (0 <= H <= 23, 0 <= M <= 59)

출력
첫째 줄에 설정한 알람 시간을 출력한다.

예제 입력
0 30
예제 출력
23 45

예제 입력
23 40
예제 출력
22 55
*/
#include <stdio.h>

int main(void) {
    int H, M;
    printf("현재 시각: ");
    scanf("%d %d", &H, &M);
    
    M -= 45;
    
    if (M < 0) {
        H -= 1;
        M += 60;
    }
    if (H < 0) {
        H = 23;
    }
    printf("알람: %d %d \n", H, M);
    return 0;
}
